In [38]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as mlt
import os

In [36]:
df = pd.read_csv("data/pune_weather.csv")
df.head()

   Unnamed: 0  latitude  longitude  valid_time        t2m  number   tp
0           0      18.4       73.5  2024-01-01  296.15250       0  0.0
1           1      18.4       73.5  2024-01-02  296.33920       0  0.0
2           2      18.4       73.5  2024-01-03  296.38007       0  0.0
3           3      18.4       73.5  2024-01-04  295.82150       0  0.0
4           4      18.4       73.5  2024-01-05  295.00024       0  0.0

In [ ]:
df = pd.read_csv("data/pune_weather_1.csv")
df.head()

   sr  latitude  longitude valid_time        t2m      temp   tp
0   0      18.4       73.5   01-01-24  296.15250  23.00250  0.0
1   1      18.4       73.5   02-01-24  296.33920  23.18920  0.0
2   2      18.4       73.5   03-01-24  296.38007  23.23007  0.0
3   3      18.4       73.5   04-01-24  295.82150  22.67150  0.0
4   4      18.4       73.5   05-01-24  295.00024  21.85024  0.0

In [ ]:
df_final = df.drop('t2m', axis=1)
df_final

      sr  latitude  longitude valid_time      temp   tp
0      0      18.4      73.50   01-01-24  23.00250  0.0
1      1      18.4      73.50   02-01-24  23.18920  0.0
2      2      18.4      73.50   03-01-24  23.23007  0.0
3      3      18.4      73.50   04-01-24  22.67150  0.0
4      4      18.4      73.50   05-01-24  21.85024  0.0
..   ...       ...        ...        ...       ...  ...
665  665      18.4      73.75   26-11-24  19.75384  0.0
666  666      18.4      73.75   27-11-24  19.59924  0.0
667  667      18.4      73.75   28-11-24  19.42425  0.0
668  668      18.4      73.75   29-11-24  19.29058  0.0
669  669      18.4      73.75   30-11-24  19.21465  0.0

[670 rows x 6 columns]

In [ ]:
if os.path.exists("data/pune_weather_final.csv"):
    print("The file alredy exists")
else:
    df_final.to_csv("data/pune_weather_final.csv")
    print("File created successfully")
    
df_final.head()

The file alredy exists

   sr  latitude  longitude valid_time      temp   tp
0   0      18.4       73.5   01-01-24  23.00250  0.0
1   1      18.4       73.5   02-01-24  23.18920  0.0
2   2      18.4       73.5   03-01-24  23.23007  0.0
3   3      18.4       73.5   04-01-24  22.67150  0.0
4   4      18.4       73.5   05-01-24  21.85024  0.0